load-test/2000-in-min.yaml
config:
  target: ""
  phases:
    - duration: 10
      arrivalCount: 1000
  processor: "./data-generate.js"

scenarios:
  - name: "Health"
    flow:
      - get:
          beforeResponse: printStatus
          url: "/health"
  - name: "Get block by hash"
    flow:
      - get:
          beforeRequest: randomBlockHash
          beforeResponse: printStatus
          url: "/blocks/{{ blockHash }}"
  - name: "Get blocks paginated"
    flow:
      - get:
          beforeRequest: randomPageNumber
          afterResponse: printStatus
          url: "/blocks-paginated?page={{ pageNumber }}"
  # - name: "Get transactions paginated"
  #   flow:
  #     - get:
  #         beforeRequest: randomPageNumber
  #         afterResponse: printStatus
  #         url: "/transactions-paginated?page={{ pageNumber }}"